{
  "hero.title": {
    "en": "Germanefkolo",
    "de": "Germanefkolo",
    "el": "Germanefkolo"
  },
  "hero.subtitle.prefix": {
    "en": "Time",
    "de": "Zeit",
    "el": "Ώρα"
  },
  "hero.subtitle.option1": {
    "en": "Time to learn German!",
    "de": "Zeit zum Deutschlernen!",
    "el": "Ώρα να μάθετε γερμανικά!"
  },
  "hero.subtitle.option2": {
    "en": "Time to be creative!",
    "de": "Zeit für Kreativität!",
    "el": "Ώρα για δημιουργικότητα!"
  },
  "hero.subtitle.option3": {
    "en": "Time to work together!",
    "de": "Zeit zur Zusammenarbeit!",
    "el": "Ώρα για συνεργασία!"
  },
  "hero.button": {
    "en": "Get Started",
    "de": "Jetzt anmelden",
    "el": "Ξεκινήστε"
  },
  "about.title": {
    "en": "About Me",
    "de": "Über mich",
    "el": "Σχετικά με εμένα"
  },
  "about.description": {
    "en": "My name is Panagiotis Daras and I have been teaching German for 15 years, specializing in preparing students for all language proficiency exams (Goethe, ÖSD). My expertise lies in training adults for relocation to German-speaking countries and improving the daily communication of those already living there. I apply modern teaching methods, provide free educational materials, and adapt my teaching model to each student's pace, with special attention to their psychological and emotional needs.",
    "de": "Mein Name ist Panagiotis Daras und ich unterrichte seit 15 Jahren Deutsch und spezialisiere mich auf die Vorbereitung von Schülern für alle Sprachprüfungen (Goethe, ÖSD). Mein Schwerpunkt liegt in der Ausbildung von Erwachsenen für die Umsiedlung in deutschsprachige Länder und der Verbesserung der täglichen Kommunikation derer, die bereits dort leben. Ich wende moderne Lehrmethoden an, stelle kostenlose Lehrmaterialien zur Verfügung und passe mein Unterrichtsmodell dem Tempo jedes Schülers an, wobei ich besonderes Augenmerk auf ihre psychologischen und emotionalen Bedürfnisse lege.",
    "el": "Το όνομά μου είναι Παναγιώτης Δάρας και παραδίδω ιδιαίτερα μαθήματα γερμανικών εδώ και 15 έτη, αναλαμβάνοντας την προετοιμασία μαθητών για εξετάσεις όλων των φορέων γλωσσομάθειας (Goethe, Ösd). Εξειδίκευση μου η εκπαίδευση ενηλίκων με σκοπό την εγκατάστασή τους σε γερμανόφωνες χώρες καθώς και η ποιοτική επικοινωνία στην καθημερινότητα εκείνων που ήδη διαμένουν σε γερμανόφωνες χώρες. Εφαρμόζω σύγχρονες μεθόδους διδασκαλίας, παρέχω δωρεάν εκπαιδευτικό υλικό και προσαρμόζω τα διδακτικό μου μοντέλο στους ρυθμούς του κάθε μαθητή, στου οποίου τις ψυχοσυναισθηματικές ανάγκες δίνω ιδιαίτερη έμφαση."
  },
  "about.button": {
    "en": "Show More",
    "de": "Mehr anzeigen",
    "el": "Εμφάνιση περισσότερων"
  },
  "about.showMore": {
    "en": "Show More",
    "de": "Mehr anzeigen",
    "el": "Εμφάνιση περισσότερων"
  },
  "about.showLess": {
    "en": "Show Less",
    "de": "Weniger anzeigen",
    "el": "Εμφάνιση λιγότερων"
  },
  "services.title": {
    "en": "My Services",
    "de": "Meine Angebote",
    "el": "Οι Υπηρεσίες μου"
  },
  "services.individual": {
    "en": "Individual Lessons",
    "de": "Einzelunterricht",
    "el": "Ατομικά Μαθήματα"
  },
  "services.individual.desc": {
    "en": "Personalized lessons tailored to your individual needs.",
    "de": "Persönlicher Unterricht, der auf Ihre individuellen Bedürfnisse zugeschnitten ist.",
    "el": "Εξατομικευμένα μαθήματα προσαρμοσμένα στις ατομικές σας ανάγκες."
  },
  "services.group": {
    "en": "Group Courses",
    "de": "Gruppenkurse",
    "el": "Ομαδικά Μαθήματα"
  },
  "services.group.desc": {
    "en": "Interactive group courses for a dynamic learning experience.",
    "de": "Interaktive Gruppenkurse für ein dynamisches Lernerlebnis.",
    "el": "Διαδραστικά ομαδικά μαθήματα για μια δυναμική εμπειρία μάθησης."
  },
  "services.exam": {
    "en": "Exam Preparation",
    "de": "Prüfungsvorbereitung",
    "el": "Προετοιμασία Εξετάσεων"
  },
  "services.exam.desc": {
    "en": "Targeted preparation for Goethe / ÖSD / TestDaF / Telc certificates and other language exams.",
    "de": "Gezielte Vorbereitung auf Goethe / ÖSD / TestDaF / Telc -Zertifikate und andere Sprachprüfungen.",
    "el": "Στοχευμένη προετοιμασία για πιστοποιητικά Goethe / ÖSD / TestDaF / Telc και άλλες γλωσσικές εξετάσεις."
  },
  "testimonials.title": {
    "en": "What My Students Say",
    "de": "Was meine Schüler sagen",
    "el": "Τι λένε οι μαθητές μου"
  },
  "contact.title": {
    "en": "Contact",
    "de": "Kontakt",
    "el": "Επικοινωνία"
  },
  "contact.quick_response": {
    "en": "I promise to respond to your email within 24 hours. Looking forward to hearing from you!",
    "de": "Ich verspreche, Ihre E-Mail innerhalb von 24 Stunden zu beantworten. Ich freue mich auf Ihre Nachricht!",
    "el": "Υπόσχομαι να απαντήσω στο email σας εντός 24 ωρών. Ανυπομονώ να ακούσω από εσάς!"
  },
  "contact.email_button": {
    "en": "Send Email",
    "de": "E-Mail senden",
    "el": "Αποστολή Email"
  },
  "contact.email": {
    "en": "panagiotisdrs@gmail.com",
    "de": "panagiotisdrs@gmail.com",
    "el": "panagiotisdrs@gmail.com"
  },
  "footer.about": {
    "en": "About Me",
    "de": "Über mich",
    "el": "Σχετικά με εμένα"
  },
  "footer.about.desc": {
    "en": "Professional German language instruction for all levels.",
    "de": "Professioneller Deutschunterricht für alle Niveaus.",
    "el": "Επαγγελματική διδασκαλία γερμανικών για όλα τα επίπεδα."
  },
  "footer.quicklinks": {
    "en": "Quick Links",
    "de": "Schnellzugriff",
    "el": "Γρήγοροι Σύνδεσμοι"
  },
  "footer.home": {
    "en": "Home",
    "de": "Startseite",
    "el": "Αρχική"
  },
  "footer.services": {
    "en": "Services",
    "de": "Angebote",
    "el": "Υπηρεσίες"
  },
  "footer.contact": {
    "en": "Contact",
    "de": "Kontakt",
    "el": "Επικοινωνία"
  },
  "footer.copyright": {
    "en": "© 2024 German Language Instruction. All rights reserved.",
    "de": "© 2024 Deutschunterricht. Alle Rechte vorbehalten.",
    "el": "© 2024 Διδασκαλία Γερμανικών. Όλα τα δικαιώματα διατηρούνται."
  },
  "testimonials": {
    "en": {
      "title": "What My Students Say",
      "list": [
        {
          "name": "Aggeliki-Maria Antonopoulou",
          "comment": "The best German teacher! For anyone interested in learning German properly in a short time and with the best guidance, turn only to him. I started with him at B2 level and in 12 months I took Goethe C1 exams! The lessons were very pleasant and adapted to my needs and schedule. Excellent organization, very well organized and experienced teacher and above all a good person!! Always willing to listen to you and work with you because he wants to see you succeed. I thank him very much for being by my side in this struggle of mine and I am grateful that I had the chance to meet him."
        },
        {
          "name": "Eleftheria Stoupaki",
          "comment": "Panos is a very good person with knowledge of the German language, love for the subject and the ability to transmit knowledge. His lessons are enjoyable and at the same time prepare you very well for the goal you have set."
        },
        {
          "name": "Ioanna Potiriadi",
          "comment": "Panos is an excellent German teacher who manages to combine excellent knowledge of the language with a teaching approach that excites and inspires his students. His method is extremely well organized, with emphasis on practical exercise and interaction, making the lessons much more effective and interesting. He is patient and has the talent to adapt his teaching to the needs and level of each student, helping them overcome difficulties and gain confidence in the language. Panos also has personal teaching material and uses modern means, both for teaching theory and for strengthening skills in oral and written expression. Most importantly, he creates a friendly and supportive environment where students feel comfortable expressing themselves and learning without stress. His ability to transmit knowledge in a pleasant and understandable way makes him ideal for anyone who wants to learn German with consistency and efficiency. Overall, he is an excellent teacher who combines expertise with his personal commitment to his students' success."
        },
        {
          "name": "Dionysia Ho",
          "comment": "A true connoisseur of the German language and culture! Methodical, explanatory and with great patience! Adapts to the needs and requirements of each student!"
        },
        {
          "name": "Melissa N",
          "comment": "Panos helped me understand the basic concepts of German grammar, which at first seemed complicated to me. His explanations were clear and methodical, making the learning process more accessible and effective."
        },
        {
          "name": "Stathis D",
          "comment": "Panos helped me reach B2 level in German and secure a residence permit in Switzerland. The lessons were clear and well organized, and the preparation was exactly what I needed for the exams. Thank you for the support."
        }
      ]
    },
    "de": {
      "title": "Was meine Schüler sagen",
      "list": [
        {
          "name": "Aggeliki-Maria Antonopoulou",
          "comment": "Der beste Deutschlehrer! Für alle, die in kurzer Zeit und mit der besten Anleitung richtig Deutsch lernen möchten, wenden Sie sich nur an ihn. Ich habe bei ihm auf B2-Niveau angefangen und in 12 Monaten die Goethe C1-Prüfungen abgelegt! Der Unterricht war sehr angenehm und an meine Bedürfnisse und meinen Zeitplan angepasst. Ausgezeichnete Organisation, sehr gut organisierter und erfahrener Lehrer und vor allem ein guter Mensch!! Immer bereit, Ihnen zuzuhören und mit Ihnen zu arbeiten, weil er Sie erfolgreich sehen möchte. Ich danke ihm sehr, dass er in diesem Kampf an meiner Seite war, und ich bin dankbar, dass ich die Chance hatte, ihn kennenzulernen."
        },
        {
          "name": "Eleftheria Stoupaki",
          "comment": "Panos ist ein sehr guter Mensch mit Kenntnissen der deutschen Sprache, Liebe zum Fach und der Fähigkeit, Wissen zu vermitteln. Sein Unterricht ist angenehm und bereitet Sie gleichzeitig sehr gut auf das gesetzte Ziel vor."
        },
        {
          "name": "Ioanna Potiriadi",
          "comment": "Panos ist ein ausgezeichneter Deutschlehrer, dem es gelingt, ausgezeichnete Sprachkenntnisse mit einem Unterrichtsansatz zu verbinden, der seine Schüler begeistert und inspiriert. Seine Methode ist äußerst gut organisiert, mit Schwerpunkt auf praktischen Übungen und Interaktion, was den Unterricht viel effektiver und interessanter macht. Er ist geduldig und hat das Talent, seinen Unterricht an die Bedürfnisse und das Niveau jedes Schülers anzupassen, ihnen zu helfen, Schwierigkeiten zu überwinden und Vertrauen in die Sprache zu gewinnen. Panos verfügt auch über persönliches Unterrichtsmaterial und nutzt moderne Mittel, sowohl für den Theorieunterricht als auch für die Stärkung der Fähigkeiten im mündlichen und schriftlichen Ausdruck. Am wichtigsten ist, dass er eine freundliche und unterstützende Umgebung schafft, in der sich die Schüler wohlfühlen, sich auszudrücken und ohne Stress zu lernen. Seine Fähigkeit, Wissen auf angenehme und verständliche Weise zu vermitteln, macht ihn ideal für jeden, der Deutsch mit Konsequenz und Effizienz lernen möchte. Insgesamt ist er ein ausgezeichneter Lehrer, der Fachwissen mit seinem persönlichen Engagement für den Erfolg seiner Schüler verbindet."
        },
        {
          "name": "Dionysia Ho",
          "comment": "Ein wahrer Kenner der deutschen Sprache und Kultur! Methodisch, erklärend und mit großer Geduld! Passt sich den Bedürfnissen und Anforderungen jedes Schülers an!"
        },
        {
          "name": "Melissa N",
          "comment": "Panos half mir, die grundlegenden Konzepte der deutschen Grammatik zu verstehen, die mir anfangs kompliziert erschienen. Seine Erklärungen waren klar und methodisch, was den Lernprozess zugänglicher und effektiver machte."
        },
        {
          "name": "Stathis D",
          "comment": "Panos half mir, das B2-Niveau in Deutsch zu erreichen und eine Aufenthaltserlaubnis in der Schweiz zu erhalten. Der Unterricht war klar und gut organisiert, und die Vorbereitung war genau das, was ich für die Prüfungen brauchte. Vielen Dank für die Unterstützung."
        }
      ]
    },
    "el": {
      "title": "Τι λένε οι μαθητές μας",
      "list": [
        {
          "name": "Αγγελική-Μαρία Αντωνοπούλου",
          "comment": "Ο καλύτερος δάσκαλος γερμανικών! Για όποιον ενδιαφέρεται να μάθει σωστά γερμανικά σε σύντομα χρονικό διάστημα και με την καλύτερη καθοδήγηση απευθυνθείτε μόνο σε αυτόν. Ξεκίνησα μαζί του γερμανικά με επίπεδο Β2 και σε 12 μήνες έδωσα εξετάσεις Goethe c1! Το μάθημα πολύ ευχάριστο και προσαρμοσμένο στις ανάγκες και το πρόγραμμα μου. Εξαιρετική οργάνωση, πολύ καλά οργανωμένος και έμπειρος καθηγητής και πάνω απ'ολα καλός άνθρωπος.!! Πάντα πρόθυμος να σε ακούσει και να δουλέψει μαζί σου γιατί θέλει να σε δει να πετυχαίνεις. Τον ευχαριστώ πολύ που ήταν δίπλα μου σε αυτό τον αγώνα μου και είμαι ευγνώμων που είχα την τύχη να τον γνωρίσω."
        },
        {
          "name": "Ελευθερία Στουπάκη",
          "comment": "Ο Πάνος είναι ένας πολύ καλός άνθρωπος με γνώση της γερμανικής γλώσσας, αγάπη για το αντικείμενο και μεταδοτικότητα. Το μάθημά του γίνεται ευχάριστα και ταυτόχρονα σε προετοιμάζει πολύ καλά για τον στόχο που έχεις θέσει."
        },
        {
          "name": "Ιωάννα Ποτηριάδη",
          "comment": "Ο Πάνος είναι ένας εξαιρετικός καθηγητής Γερμανικών, ο οποίος καταφέρνει να συνδυάσει την άριστη γνώση της γλώσσας με μία διδακτική προσέγγιση που ενθουσιάζει και εμπνέει τους μαθητές του. Η μέθοδός του είναι εξαιρετικά οργανωμένη, με έμφαση στην πρακτική εξάσκηση και την αλληλεπίδραση, κάτι που κάνει τα μαθήματα πολύ πιο αποδοτικά και ενδιαφέροντα. Είναι υπομονετικός και διαθέτει το ταλέντο να προσαρμόζει τη διδασκαλία του στις ανάγκες και το επίπεδο κάθε μαθητή, βοηθώντας τους να ξεπεράσουν τις δυσκολίες και να αποκτήσουν αυτοπεποίθηση στη γλώσσα. Ο Πάνος διαθέτει επιπλέον προσωπικο διδακτικό υλικό και χρησιμοποιεί σύγχρονα μέσα, τόσο για τη διδασκαλία της θεωρίας όσο και για την ενίσχυση των δεξιοτήτων στην προφορική και γραπτή έκφραση. Το σημαντικότερο όμως είναι ότι δημιουργεί ένα φιλικό και υποστηρικτικό περιβάλλον, στο οποίο οι μαθητές αισθάνονται άνετα να εκφραστούν και να μάθουν χωρίς άγχη. Η ικανότητά του να μεταδώσει τη γνώση με τρόπο ευχάριστο και κατανοητό τον καθιστά ιδανικό για όποιον θέλει να μάθει Γερμανικά με συνέπεια και αποδοτικότητα. Συνολικά, είναι ένας εξαιρετικός καθηγητής που συνδυάζει την τεχνογνωσία με την προσωπική του δέσμευση για την επιτυχία των μαθητών του."
        },
        {
          "name": "Διονυσία Χο",
          "comment": "Πραγματικός γνωστής της γερμανικής γλώσσας και κουλτούρας! Μεθοδικός, επεξηγηματικός και με τεράστια υπομονή! Προσαρμόζεται στις ανάγκες και τις απαιτήσεις του κάθε μαθητή !"
        },
        {
          "name": "Melissa N",
          "comment": "Ο Πάνος με βοήθησε να κατανοήσω τις βασικές έννοιες της γερμανικής γραμματικής, οι οποίες στην αρχή μου φαίνονταν περίπλοκες. Οι εξηγήσεις του ήταν σαφείς και μεθοδικές, κάτι που έκανε τη διαδικασία εκμάθησης πιο προσιτή και αποτελεσματική."
        },
        {
          "name": "Stathis D",
          "comment": "Ο Πάνος με βοήθησε να φτάσω στο επίπεδο Β2 στα Γερμανικά και να εξασφαλίσω άδεια παραμονής στην Ελβετία. Τα μαθήματα ήταν ξεκάθαρα και καλά οργανωμένα, και η προετοιμασία ήταν ακριβώς αυτό που χρειαζόμουν για τις εξετάσεις. Ευχαριστώ για την υποστήριξη."
        }
      ]
    }
  }
} 